; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=41, out_folder=htg/blocksworld/training, instance_id=21, seed=2045, goal_proportion=0.1

(define (problem blocksworld-21)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 - object)
 (:init 
    (arm-empty)
    (clear b28)
    (on b28 b10)
    (on b10 b14)
    (on b14 b30)
    (on b30 b19)
    (on b19 b5)
    (on b5 b25)
    (on b25 b1)
    (on-table b1)
    (clear b33)
    (on b33 b39)
    (on b39 b40)
    (on b40 b2)
    (on b2 b6)
    (on b6 b34)
    (on b34 b32)
    (on b32 b24)
    (on b24 b8)
    (on b8 b13)
    (on-table b13)
    (clear b11)
    (on b11 b31)
    (on b31 b35)
    (on b35 b17)
    (on b17 b3)
    (on b3 b18)
    (on-table b18)
    (clear b12)
    (on b12 b29)
    (on b29 b36)
    (on b36 b21)
    (on-table b21)
    (clear b38)
    (on-table b38)
    (clear b23)
    (on-table b23)
    (clear b22)
    (on b22 b15)
    (on b15 b41)
    (on-table b41)
    (clear b26)
    (on-table b26)
    (clear b20)
    (on-table b20)
    (clear b7)
    (on b7 b16)
    (on b16 b37)
    (on b37 b4)
    (on b4 b27)
    (on b27 b9)
    (on-table b9))
 (:goal  (and 
    (clear b1)
    (on b1 b3)
    (on b3 b2)
    (on b2 b4)
    (on-table b4))))

; plan
1. (unstack b7 b16)
   deleted: (on b7 b16) (clear b7) (arm-empty)
   added: (holding b7) (clear b16)
   goals met: 0 of 5
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 5
3. (unstack b16 b37)
   deleted: (on b16 b37) (clear b16) (arm-empty)
   added: (holding b16) (clear b37)
   goals met: 0 of 5
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 5
5. (unstack b37 b4)
   deleted: (on b37 b4) (clear b37) (arm-empty)
   added: (holding b37) (clear b4)
   goals met: 0 of 5
6. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 0 of 5
7. (unstack b4 b27)
   deleted: (on b4 b27) (clear b4) (arm-empty)
   added: (holding b4) (clear b27)
   goals met: 0 of 5
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 5
9. (unstack b33 b39)
   deleted: (on b33 b39) (clear b33) (arm-empty)
   added: (holding b33) (clear b39)
   goals met: 1 of 5
10. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 5
11. (unstack b39 b40)
   deleted: (on b39 b40) (clear b39) (arm-empty)
   added: (holding b39) (clear b40)
   goals met: 1 of 5
12. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 1 of 5
13. (unstack b40 b2)
   deleted: (on b40 b2) (clear b40) (arm-empty)
   added: (holding b40) (clear b2)
   goals met: 1 of 5
14. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 1 of 5
15. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 1 of 5
16. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 2 of 5
17. (unstack b11 b31)
   deleted: (on b11 b31) (clear b11) (arm-empty)
   added: (holding b11) (clear b31)
   goals met: 2 of 5
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 5
19. (unstack b31 b35)
   deleted: (on b31 b35) (clear b31) (arm-empty)
   added: (holding b31) (clear b35)
   goals met: 2 of 5
20. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 5
21. (unstack b35 b17)
   deleted: (on b35 b17) (clear b35) (arm-empty)
   added: (holding b35) (clear b17)
   goals met: 2 of 5
22. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 2 of 5
23. (unstack b17 b3)
   deleted: (on b17 b3) (clear b17) (arm-empty)
   added: (holding b17) (clear b3)
   goals met: 2 of 5
24. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 5
25. (unstack b3 b18)
   deleted: (on b3 b18) (clear b3) (arm-empty)
   added: (holding b3) (clear b18)
   goals met: 2 of 5
26. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 3 of 5
27. (unstack b28 b10)
   deleted: (on b28 b10) (clear b28) (arm-empty)
   added: (holding b28) (clear b10)
   goals met: 3 of 5
28. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 3 of 5
29. (unstack b10 b14)
   deleted: (on b10 b14) (clear b10) (arm-empty)
   added: (holding b10) (clear b14)
   goals met: 3 of 5
30. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 5
31. (unstack b14 b30)
   deleted: (on b14 b30) (clear b14) (arm-empty)
   added: (holding b14) (clear b30)
   goals met: 3 of 5
32. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 3 of 5
33. (unstack b30 b19)
   deleted: (on b30 b19) (clear b30) (arm-empty)
   added: (holding b30) (clear b19)
   goals met: 3 of 5
34. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 3 of 5
35. (unstack b19 b5)
   deleted: (on b19 b5) (clear b19) (arm-empty)
   added: (holding b19) (clear b5)
   goals met: 3 of 5
36. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 5
37. (unstack b5 b25)
   deleted: (on b5 b25) (clear b5) (arm-empty)
   added: (holding b5) (clear b25)
   goals met: 3 of 5
38. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 5
39. (unstack b25 b1)
   deleted: (on b25 b1) (clear b25) (arm-empty)
   added: (holding b25) (clear b1)
   goals met: 4 of 5
40. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 5
41. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 5
42. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 5 of 5
